Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_dma2d.c
/* Public functions */

#ifdef CONFIG_STM32L4_FB_CMAP
static int stm32_dma2d_setclut(FAR const struct fb_cmap_s *cmap);
#endif
static int stm32_dma2d_fillcolor(FAR struct stm32_dma2d_overlay_s *oinfo,
                                 FAR const struct fb_area_s *area,
                                 uint32_t argb);
static int stm32_dma2d_blit(FAR struct stm32_dma2d_overlay_s *doverlay,
                            uint32_t destxpos, uint32_t destypos,
                            FAR struct stm32_dma2d_overlay_s *soverlay,
                            FAR const struct fb_area_s *sarea);
static int stm32_dma2d_blend(FAR struct stm32_dma2d_overlay_s *doverlay,
                             uint32_t destxpos, uint32_t destypos,
                             FAR struct stm32_dma2d_overlay_s *foverlay,
                             uint32_t forexpos, uint32_t foreypos,
                             FAR struct stm32_dma2d_overlay_s *boverlay,
                             FAR const struct fb_area_s *barea);
#ifdef USE_HAL_DRIVER
static void STM32_DMA2D_CopyBuffer(uint32_t *psrc, uint32_t *pdst, uint16_t x, uint16_t y,
                            uint16_t xsize, uint16_t ysize);
static void STM32_DMA2D_SetLayer_InputColor(uint32_t pf);
static HAL_StatusTypeDef HAL_DMA2D_InitConfig(DMA2D_HandleTypeDef *hdma2d);
#endif
/****************************************************************************
 * Private Data
 ****************************************************************************/

/* The initialized state of the driver */

static bool g_initialized;

/* Allocate clut */

#ifdef CONFIG_STM32L4_FB_CMAP
static uint32_t g_clut[STM32_DMA2D_NCLUT *
#  ifdef CONFIG_STM32L4_FB_TRANSPARENCY
                      4
#  else
                      3
#  endif
                      / 4 ];
#endif /* CONFIG_STM32L4_FB_CMAP */

/* The DMA2D semaphore that enforces mutually exclusive access */

static sem_t g_lock;

/* Semaphore for interrupt handling */

static sem_t g_semirq;

/* This structure provides irq handling */

static struct stm32_interrupt_s g_interrupt =
{
  .irq     = STM32L4_IRQ_DMA2D,
  .error   = OK,
  .sem     = &g_semirq
};


static struct stm32_dma2d_s g_dma2ddev =
{
  .dma2d =
  {
#ifdef CONFIG_STM32L4_FB_CMAP
    .setclut     = stm32_dma2d_setclut,
#endif
    .fillcolor   = stm32_dma2d_fillcolor,
    .blit        = stm32_dma2d_blit,
    .blend       = stm32_dma2d_blend,
#ifdef USE_HAL_DRIVER
    .copybuffer  = STM32_DMA2D_CopyBuffer,
    .inputcolor  = STM32_DMA2D_SetLayer_InputColor
#endif
  },
#ifdef CONFIG_STM32L4_FB_CMAP
  .clut = g_clut,
#endif
  .lock = &g_lock
};

/****************************************************************************
 * Public Data
 ****************************************************************************/
#ifdef USE_HAL_DRIVER
DMA2D_HandleTypeDef   hdma2d;
#endif
/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_dma2d_control
 *
 * Description:
 *   Change the DMA2D control register
 *
 * Input Parameters:
 *   setbits - The bits to set
 *   clrbits - The bits to clear
 *
 ****************************************************************************/

static void stm32_dma2d_control(uint32_t setbits, uint32_t clrbits)
{
    return 0;
}

/****************************************************************************
 * Name: stm32_dma2dirq
 *
 * Description:
 *   DMA2D interrupt handler
 *
 ****************************************************************************/

static int stm32_dma2dirq(int irq, void *context, FAR void *arg)
{
    return 0;
}

/****************************************************************************
 * Name: stm32_dma2d_waitforirq
 *
 * Description:
 *   Helper waits until the dma2d irq occurs. That means that an ongoing clut
 *   loading or dma transfer was completed.
 *   Note! The caller must use this function within a critical section.
 *
 * Returned Value:
 *   On success OK otherwise ERROR
 *
 ****************************************************************************/

static int stm32_dma2d_waitforirq(void)
{
    return 0;
}

/****************************************************************************
 * Name: stm32_dma2d_loadclut
 *
 * Description:
 *   Starts clut loading but doesn't wait until loading is complete!
 *
 * Input Parameters:
 *   pfcreg - PFC control Register
 *
 * Returned Value:
 *   On success - OK
 *   On error - -EINVAL
 *
 ****************************************************************************/

#ifdef CONFIG_STM32L4_DMA2D_L8
static int stm32_dma2d_loadclut(uintptr_t pfcreg)
{
    return 0;
}
#endif

/****************************************************************************
 * Name: stm32_dma2d_start
 *
 * Description:
 *   Starts the dma transfer and waits until completed.
 *
 * Input Parameters:
 *   reg       - Register to set the start
 *   startflag - The related flag to start the dma transfer
 *   irqflag   - The interrupt enable flag in the DMA2D_CR register
 *
 ****************************************************************************/

static int stm32_dma2d_start(void)
{
    return 0;
}

/****************************************************************************
 * Name: stm32_dma2d_memaddress
 *
 * Description:
 *   Helper to calculate the layer memory address
 *
 * Input Parameters:
 *   oinfo - Reference to overlay information
 *   xpos  - x-Offset
 *   ypos  - y-Offset
 *
 * Returned Value:
 *   memory address
 *
 ****************************************************************************/

static uint32_t stm32_dma2d_memaddress(FAR struct stm32_dma2d_overlay_s *oinfo,
                                       uint32_t xpos, uint32_t ypos)
{
    return 0;
}

/****************************************************************************
 * Name: stm32_dma2d_lineoffset
 *
 * Description:
 *   Helper to calculate the layer line offset
 *
 * Input Parameters:
 *   oinfo - Reference to overlay information
 *
 * Returned Value:
 *   line offset
 *
 ****************************************************************************/

static uint32_t stm32_dma2d_lineoffset(FAR struct stm32_dma2d_overlay_s *oinfo,
                                       FAR const struct fb_area_s *area)
{
    return 0;
}

/****************************************************************************
 * Name: stm32_dma2d_lfifo
 *
 * Description:
 *   Set the fifo for the foreground, background and output layer
 *   Configures the memory address register
 *   Configures the line offset register
 *
 * Input Parameters:
 *   layer - Reference to the common layer state structure
 *
 ****************************************************************************/

static void stm32_dma2d_lfifo(FAR struct stm32_dma2d_overlay_s *oinfo,
                              int lid, uint32_t xpos, uint32_t ypos,
                              FAR const struct fb_area_s *area)
{

